
set_property IOSTANDARD LVCMOS25 [get_ports GMII_COL_IN]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_CRS_IN]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_GTXCLK_OUT]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_MDC_OUT]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_MDIO_IO]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_RSTn_OUT]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_RXD_IN[0]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_RXD_IN[1]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_RXD_IN[2]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_RXD_IN[3]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_RXD_IN[4]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_RXD_IN[5]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_RXD_IN[6]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_RXD_IN[7]}]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_RX_CLK_IN]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_RX_DV_IN]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_RX_ER_IN]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_TXD_OUT[0]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_TXD_OUT[1]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_TXD_OUT[2]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_TXD_OUT[3]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_TXD_OUT[4]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_TXD_OUT[5]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_TXD_OUT[6]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GMII_TXD_OUT[7]}]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_TX_CLK_IN]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_TX_EN_OUT]
set_property IOSTANDARD LVCMOS25 [get_ports GMII_TX_ER_OUT]
set_property IOSTANDARD LVCMOS25 [get_ports I2C_SDA_IO]
set_property IOSTANDARD LVCMOS25 [get_ports I2C_SCL_OUT]
set_property IOSTANDARD LVCMOS15 [get_ports SW_N_IN]
set_property IOSTANDARD LVCMOS25 [get_ports {GPIO_DIP_SW_IN[3]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GPIO_DIP_SW_IN[2]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GPIO_DIP_SW_IN[1]}]
set_property IOSTANDARD LVCMOS25 [get_ports {GPIO_DIP_SW_IN[0]}]
set_property IOSTANDARD LVDS [get_ports SYSCLK_200MP_IN]
set_property IOSTANDARD LVDS [get_ports SYSCLK_200MN_IN]


set_property PACKAGE_PIN AD11 [get_ports SYSCLK_200MN_IN]
set_property PACKAGE_PIN AD12 [get_ports SYSCLK_200MP_IN]
set_property PACKAGE_PIN L20 [get_ports GMII_RSTn_OUT]
set_property PACKAGE_PIN M27 [get_ports GMII_TX_EN_OUT]
set_property PACKAGE_PIN N27 [get_ports {GMII_TXD_OUT[0]}]
set_property PACKAGE_PIN N25 [get_ports {GMII_TXD_OUT[1]}]
set_property PACKAGE_PIN M29 [get_ports {GMII_TXD_OUT[2]}]
set_property PACKAGE_PIN L28 [get_ports {GMII_TXD_OUT[3]}]
set_property PACKAGE_PIN J26 [get_ports {GMII_TXD_OUT[4]}]
set_property PACKAGE_PIN K26 [get_ports {GMII_TXD_OUT[5]}]
set_property PACKAGE_PIN L30 [get_ports {GMII_TXD_OUT[6]}]
set_property PACKAGE_PIN J28 [get_ports {GMII_TXD_OUT[7]}]
set_property PACKAGE_PIN N29 [get_ports GMII_TX_ER_OUT]
set_property PACKAGE_PIN U27 [get_ports GMII_RX_CLK_IN]
set_property PACKAGE_PIN R28 [get_ports GMII_RX_DV_IN]
set_property PACKAGE_PIN U30 [get_ports {GMII_RXD_IN[0]}]
set_property PACKAGE_PIN U25 [get_ports {GMII_RXD_IN[1]}]
set_property PACKAGE_PIN T25 [get_ports {GMII_RXD_IN[2]}]
set_property PACKAGE_PIN U28 [get_ports {GMII_RXD_IN[3]}]
set_property PACKAGE_PIN R19 [get_ports {GMII_RXD_IN[4]}]
set_property PACKAGE_PIN T27 [get_ports {GMII_RXD_IN[5]}]
set_property PACKAGE_PIN T26 [get_ports {GMII_RXD_IN[6]}]
set_property PACKAGE_PIN T28 [get_ports {GMII_RXD_IN[7]}]
set_property PACKAGE_PIN V26 [get_ports GMII_RX_ER_IN]
set_property PACKAGE_PIN R30 [get_ports GMII_CRS_IN]
set_property PACKAGE_PIN W19 [get_ports GMII_COL_IN]
set_property PACKAGE_PIN J21 [get_ports GMII_MDIO_IO]
set_property PACKAGE_PIN K30 [get_ports GMII_GTXCLK_OUT]
set_property PACKAGE_PIN M28 [get_ports GMII_TX_CLK_IN]
set_property PACKAGE_PIN R23 [get_ports GMII_MDC_OUT]
set_property PACKAGE_PIN L21 [get_ports I2C_SDA_IO]
set_property PACKAGE_PIN K21 [get_ports I2C_SCL_OUT]
set_property PACKAGE_PIN AA12 [get_ports SW_N_IN]
set_property PACKAGE_PIN Y28 [get_ports {GPIO_DIP_SW_IN[3]}]
set_property PACKAGE_PIN AA28 [get_ports {GPIO_DIP_SW_IN[2]}]
set_property PACKAGE_PIN W29 [get_ports {GPIO_DIP_SW_IN[1]}]
set_property PACKAGE_PIN Y29 [get_ports {GPIO_DIP_SW_IN[0]}]

create_clock -period 5.000 -name SYSCLK_200MP_IN -waveform {0.000 2.500} [get_ports SYSCLK_200MP_IN]
create_clock -period 40.000 -name GMII_TX_CLK_IN -waveform {0.000 20.000} [get_ports GMII_TX_CLK_IN]
create_clock -period 8.000 -name GMII_RX_CLK_IN -waveform {0.000 4.000} [get_ports GMII_RX_CLK_IN]
set_clock_groups -group [get_clocks GMII_TX_CLK_IN] -group [get_clocks CLK_125M] -logically_exclusive

set_false_path -from [get_pins CNT_RST_reg/C] -to [get_pins RX_CNT_reg*/CLR]
set_max_delay -datapath_only -from [get_pins {RX_CNT_reg[6]/C}] -to [get_pins GMII_1000M_reg/D] 5.000
set_false_path -from [get_pins GMII_1000M_reg/C]
set_false_path -through [get_nets RST_EEPROM]

set_property IOB false [get_cells -hierarchical -filter {name =~ */GMII_RXCNT/IOB_RD*}]
set_property IOB false [get_cells -hierarchical -filter {name =~ */GMII_RXCNT/IOB_RDV}]
set_property IOB false [get_cells -hierarchical -filter {name =~ */GMII_RXCNT/IOB_RERR}]


set_input_delay -clock [get_clocks GMII_RX_CLK_IN] -min 0 [get_ports GMII_RXD_IN*]
set_input_delay -clock [get_clocks GMII_RX_CLK_IN] -min 0 [get_ports GMII_RX_ER_IN]
set_input_delay -clock [get_clocks GMII_RX_CLK_IN] -min 0 [get_ports GMII_RX_DV_IN]
set_input_delay -clock [get_clocks GMII_RX_CLK_IN] -max 6 [get_ports GMII_RXD_IN*]
set_input_delay -clock [get_clocks GMII_RX_CLK_IN] -max 6 [get_ports GMII_RX_ER_IN]
set_input_delay -clock [get_clocks GMII_RX_CLK_IN] -max 6 [get_ports GMII_RX_DV_IN]

set_property IOB true [get_cells -hierarchical -filter {name =~ */GMII_TXCNT/IOB_TD_*}]
set_property IOB true [get_cells -hierarchical -filter {name =~ */GMII_TXCNT/IOB_TEN}]

create_generated_clock -source [get_pins GMIIMUX/I1] -divide_by 1 -invert [get_ports GMII_GTXCLK_OUT] 
set_clock_groups -group {GMII_TX_CLK_IN} -group {CLK_125M GMII_GTXCLK_OUT} -asynchronous

set_output_delay -max 15 -clock GMII_TX_CLK_IN [get_ports GMII_TXD_OUT*]
set_output_delay -min  0 -clock GMII_TX_CLK_IN [get_ports GMII_TXD_OUT*]
set_output_delay -max 15 -clock GMII_TX_CLK_IN [get_ports GMII_TX_EN_OUT]
set_output_delay -min  0 -clock GMII_TX_CLK_IN [get_ports GMII_TX_EN_OUT]
set_output_delay -max 15 -clock GMII_TX_CLK_IN [get_ports GMII_TX_ER_OUT]
set_output_delay -min  0 -clock GMII_TX_CLK_IN [get_ports GMII_TX_ER_OUT]

set_output_delay -max  2.5 -clock GMII_GTXCLK_OUT [get_ports GMII_TXD_OUT*] -add_delay
set_output_delay -min -0.5 -clock GMII_GTXCLK_OUT [get_ports GMII_TXD_OUT*] -add_delay
set_output_delay -max  2.5 -clock GMII_GTXCLK_OUT [get_ports GMII_TX_EN_OUT] -add_delay
set_output_delay -min -0.5 -clock GMII_GTXCLK_OUT [get_ports GMII_TX_EN_OUT] -add_delay
set_output_delay -max  2.5 -clock GMII_GTXCLK_OUT [get_ports GMII_TX_ER_OUT] -add_delay
set_output_delay -min -0.5 -clock GMII_GTXCLK_OUT [get_ports GMII_TX_ER_OUT] -add_delay

set_max_delay -datapath_only -from [get_clocks -of_objects [get_pins PLLE2_BASE/CLKOUT1]] -to [get_ports GMII_MDC_OUT] 10
set_max_delay -datapath_only -from [get_clocks -of_objects [get_pins PLLE2_BASE/CLKOUT1]] -to [get_ports GMII_MDIO_IO] 10
set_max_delay -datapath_only -from [get_clocks -of_objects [get_pins PLLE2_BASE/CLKOUT1]] -to [get_ports GMII_RSTn_OUT] 10
set_max_delay -datapath_only -from [get_clocks -of_objects [get_pins PLLE2_BASE/CLKOUT1]] -to [get_ports I2C_SCL_OUT] 10
set_max_delay -datapath_only -from [get_clocks -of_objects [get_pins PLLE2_BASE/CLKOUT1]] -to [get_ports I2C_SDA_IO] 10
set_max_delay -datapath_only -from [get_clocks -of_objects [get_pins PLLE2_BASE/CLKOUT0]] -to [get_ports GMII_GTXCLK_OUT] 4

set_max_delay -from [get_ports GMII_MDIO_IO]  5
set_min_delay -from [get_ports GMII_MDIO_IO] -5
set_max_delay -from [get_ports I2C_SDA_IO]  5
set_min_delay -from [get_ports I2C_SDA_IO] -5
set_max_delay -from [get_ports GPIO_DIP_SW_IN*] 10
set_min_delay -from [get_ports GPIO_DIP_SW_IN*] 0
set_max_delay -from [get_ports SW_N_IN] 10
set_min_delay -from [get_ports SW_N_IN] 0


set_property BITSTREAM.GENERAL.COMPRESS TRUE [current_design]
set_property BITSTREAM.CONFIG.CONFIGRATE 6 [current_design]
set_property BITSTREAM.CONFIG.SPI_BUSWIDTH 4 [current_design]
set_property CONFIG_VOLTAGE 2.5 [current_design]
set_property CFGBVS VCCO [current_design]

